Uni-Libraries/Uni.HAL/src/rcc/uni_hal_rcc_stm32h7.c
//
// Includes
//

// stdlib
#include <stdbool.h>
#include <stdint.h>
#include <string.h>

// cmsis
#include <stm32h7xx.h>

// st
#include <stm32h7xx_ll_cortex.h>
#include <stm32h7xx_ll_rcc.h>
#include <stm32h7xx_ll_system.h>
#include <stm32h7xx_ll_utils.h>

// Uni.Common
#include <uni_common.h>

// uni_hal
#include "dwt/uni_hal_dwt.h"
#include "flash/uni_hal_flash.h"
#include "gpio/uni_hal_gpio.h"
#include "pwr/uni_hal_pwr_stm32.h"
#include "rcc/uni_hal_rcc.h"
#include "rcc/uni_hal_rcc_stm32h7.h"
#include "systick/uni_hal_systick.h"



//
// Globals
//

uni_hal_rcc_stm32h7_config_t* g_uni_hal_rcc_config = nullptr;
uni_hal_rcc_stm32h7_status_t  g_uni_hal_rcc_status = { 0 };



//
// Private
//


typedef struct {
    uint32_t rcc_cr;
    uint32_t rcc_cfgr;
    uint32_t rcc_pllckselr;
    uint32_t rcc_pllcfgr;
    uint32_t rcc_pll1divr;
    uint32_t rcc_pll2divr;
    uint32_t rcc_pll3divr;
    uint32_t rcc_cifr;
    uint32_t rcc_rsr;
    uint32_t pwr_csr1;
    uint32_t pwr_d3cr;
    uint32_t flash_acr;
    uint32_t systick_ms;
} uni_hal_rcc_stm32h7_diag_t;


static volatile uni_hal_rcc_stm32h7_diag_t g_uni_hal_rcc_diag_boot = { 0 };
static volatile uint32_t g_uni_hal_rcc_reset_flags_shadow = 0U;
static volatile bool g_uni_hal_rcc_css_nmi_processing = false;
static volatile bool g_uni_hal_rcc_css_event_latched = false;
static volatile bool g_uni_hal_rcc_reconfig_in_progress = false;


typedef enum {
    UNI_HAL_RCC_BOOT_STAGE_NONE = 0,
    UNI_HAL_RCC_BOOT_STAGE_FLASH,
    UNI_HAL_RCC_BOOT_STAGE_HSE,
    UNI_HAL_RCC_BOOT_STAGE_CSI,
    UNI_HAL_RCC_BOOT_STAGE_HSI,
    UNI_HAL_RCC_BOOT_STAGE_PLL,
    UNI_HAL_RCC_BOOT_STAGE_SYSCLK,
    UNI_HAL_RCC_BOOT_STAGE_CSS_RECOVERY
} uni_hal_rcc_boot_stage_e;


static volatile uni_hal_rcc_boot_stage_e g_uni_hal_rcc_boot_stage = UNI_HAL_RCC_BOOT_STAGE_NONE;


enum {
    UNI_HAL_RCC_NMI_WAIT_ITERATIONS = 500000U,
};


typedef struct {
    bool dwt_ready;
    uint32_t start_tick;
    uint32_t timeout_tick;
    uint32_t start_ms;
    uint32_t timeout_ms;
} uni_hal_rcc_wait_timeout_t;


static void _uni_hal_stm_rcc_diag_capture(volatile uni_hal_rcc_stm32h7_diag_t* dst) {
    if (dst == nullptr) {
        return;
    }

    dst->rcc_cr = RCC->CR;
    dst->rcc_cfgr = RCC->CFGR;
    dst->rcc_pllckselr = RCC->PLLCKSELR;
    dst->rcc_pllcfgr = RCC->PLLCFGR;
    dst->rcc_pll1divr = RCC->PLL1DIVR;
    dst->rcc_pll2divr = RCC->PLL2DIVR;
    dst->rcc_pll3divr = RCC->PLL3DIVR;
    dst->rcc_cifr = RCC->CIFR;
    uint32_t reset_flags = g_uni_hal_rcc_reset_flags_shadow;
    if (reset_flags == 0U) {
        reset_flags = RCC->RSR;
    }
    dst->rcc_rsr = reset_flags;
    dst->pwr_csr1 = PWR->CSR1;
    dst->pwr_d3cr = PWR->D3CR;
    dst->flash_acr = FLASH->ACR;
    dst->systick_ms = uni_hal_systick_get_ms();
}


static void _uni_hal_stm_rcc_wait_timeout_begin(uni_hal_rcc_wait_timeout_t* timeout_ctx, uint32_t timeout_ms) {
    if (timeout_ctx == nullptr) {
        return;
    }

    timeout_ctx->dwt_ready = uni_hal_dwt_is_inited();
    timeout_ctx->start_tick = 0U;
    timeout_ctx->timeout_tick = 0U;
    timeout_ctx->start_ms = uni_hal_systick_get_ms();
    timeout_ctx->timeout_ms = timeout_ms;

    if (timeout_ctx->dwt_ready) {
        timeout_ctx->start_tick = uni_hal_dwt_get_tick();
        timeout_ctx->timeout_tick = uni_hal_dwt_timeout_ms_to_tick(timeout_ms);
    }
}


static bool _uni_hal_stm_rcc_wait_timeout_expired(const uni_hal_rcc_wait_timeout_t* timeout_ctx) {
    if (timeout_ctx == nullptr) {
        return true;
    }

    if (timeout_ctx->timeout_ms == 0U) {
        return true;
    }

    if (timeout_ctx->dwt_ready) {
        if (timeout_ctx->timeout_tick == 0U) {
            uint32_t elapsed_ms = uni_hal_systick_get_ms() - timeout_ctx->start_ms;
            return elapsed_ms >= timeout_ctx->timeout_ms;
        }

        uint32_t elapsed_tick = uni_hal_dwt_compare(timeout_ctx->start_tick, uni_hal_dwt_get_tick());
        return elapsed_tick >= timeout_ctx->timeout_tick;
    }

    uint32_t elapsed_ms = uni_hal_systick_get_ms() - timeout_ctx->start_ms;
    return elapsed_ms >= timeout_ctx->timeout_ms;
}


static bool _uni_hal_stm_rcc_wait_ready(uint32_t (*get_state)(void), bool expected_state, uint32_t timeout_ms) {
    if (get_state == nullptr) {
        return false;
    }

    if (((get_state() != 0U) == expected_state)) {
        return true;
    }

    uni_hal_rcc_wait_timeout_t timeout_ctx = { 0 };
    _uni_hal_stm_rcc_wait_timeout_begin(&timeout_ctx, timeout_ms);

    while (((get_state() != 0U) != expected_state)) {
        if (_uni_hal_stm_rcc_wait_timeout_expired(&timeout_ctx)) {
            return false;
        }
    }

    return true;
}


static bool _uni_hal_stm_rcc_wait_ready_nmi(uint32_t (*get_state)(void), bool expected_state) {
    if (get_state == nullptr) {
        return false;
    }

    uint32_t wait_counter = UNI_HAL_RCC_NMI_WAIT_ITERATIONS;
    while (((get_state() != 0U) != expected_state) && (wait_counter > 0U)) {
        wait_counter--;
    }

    return ((get_state() != 0U) == expected_state);
}


static uint32_t _uni_hal_stm_rcc_get_pll_input_range(uint32_t input_hz)
{
    uint32_t result = LL_RCC_PLLINPUTRANGE_1_2;
    if (input_hz >= 8'000'000)
    {
        result = LL_RCC_PLLINPUTRANGE_8_16;
    }
    else if (input_hz >= 4'000'000U) {
        result = LL_RCC_PLLINPUTRANGE_4_8;
    }
    else if (input_hz >= 2'000'000U) {
        result = LL_RCC_PLLINPUTRANGE_2_4;
    }
    return result;
}


static bool _uni_hal_stm_rcc_wait_sysclk_status(uint32_t status, uint32_t timeout_ms) {
    if (LL_RCC_GetSysClkSource() == status) {
        return true;
    }

    uni_hal_rcc_wait_timeout_t timeout_ctx = { 0 };
    _uni_hal_stm_rcc_wait_timeout_begin(&timeout_ctx, timeout_ms);

    while (LL_RCC_GetSysClkSource() != status) {
        if (_uni_hal_stm_rcc_wait_timeout_expired(&timeout_ctx)) {
            return false;
        }
    }

    return true;
}


static bool _uni_hal_stm_rcc_switch_sysclk(uint32_t source, uint32_t status, uint32_t timeout_ms) {
    LL_RCC_SetSysClkSource(source);
    return _uni_hal_stm_rcc_wait_sysclk_status(status, timeout_ms);
}


static bool _uni_hal_stm_rcc_switch_sysclk_nmi(uint32_t source, uint32_t status) {
    LL_RCC_SetSysClkSource(source);

