Uni-Libraries/Uni.HAL/src/rcc/uni_hal_rcc_stm32h7.c
    uint32_t wait_counter = UNI_HAL_RCC_NMI_WAIT_ITERATIONS;
    while ((LL_RCC_GetSysClkSource() != status) && (wait_counter > 0U)) {
        wait_counter--;
    }

    return (LL_RCC_GetSysClkSource() == status);
}


static bool _uni_hal_stm_rcc_nmi_fallback_to_safe_clk(void) {
    bool switched = false;

    LL_RCC_HSI_Enable();
    g_uni_hal_rcc_status.hsi_inited = _uni_hal_stm_rcc_wait_ready_nmi(LL_RCC_HSI_IsReady, true);
    if (g_uni_hal_rcc_status.hsi_inited) {
        switched = _uni_hal_stm_rcc_switch_sysclk_nmi(LL_RCC_SYS_CLKSOURCE_HSI,
                                                       LL_RCC_SYS_CLKSOURCE_STATUS_HSI);
    }

    if (!switched) {
        LL_RCC_CSI_Enable();
        g_uni_hal_rcc_status.csi_inited = _uni_hal_stm_rcc_wait_ready_nmi(LL_RCC_CSI_IsReady, true);
        if (g_uni_hal_rcc_status.csi_inited) {
            switched = _uni_hal_stm_rcc_switch_sysclk_nmi(LL_RCC_SYS_CLKSOURCE_CSI,
                                                           LL_RCC_SYS_CLKSOURCE_STATUS_CSI);
        }
    }

    g_uni_hal_rcc_status.sys_inited = switched;
    if (switched) {
        SystemCoreClockUpdate();
        (void)uni_hal_systick_init();
    }

    return switched;
}


static bool _uni_hal_stm_rcc_fallback_to_safe_clk(uint32_t timeout_ms) {
    bool hsi_ready = (LL_RCC_HSI_IsReady() != 0U);
    if (!hsi_ready) {
        LL_RCC_HSI_Enable();
        hsi_ready = _uni_hal_stm_rcc_wait_ready(LL_RCC_HSI_IsReady, true, timeout_ms);
    }
    g_uni_hal_rcc_status.hsi_inited = hsi_ready;

    bool csi_ready = (LL_RCC_CSI_IsReady() != 0U);
    if (!hsi_ready && !csi_ready) {
        LL_RCC_CSI_Enable();
        csi_ready = _uni_hal_stm_rcc_wait_ready(LL_RCC_CSI_IsReady, true, timeout_ms);
    }
    g_uni_hal_rcc_status.csi_inited = csi_ready;

    if (hsi_ready) {
        if (_uni_hal_stm_rcc_switch_sysclk(LL_RCC_SYS_CLKSOURCE_HSI,
                                           LL_RCC_SYS_CLKSOURCE_STATUS_HSI,
                                           timeout_ms)) {
            g_uni_hal_rcc_status.sys_inited = true;
            SystemCoreClockUpdate();
            return true;
        }
    }

    if (csi_ready) {
        if (_uni_hal_stm_rcc_switch_sysclk(LL_RCC_SYS_CLKSOURCE_CSI,
                                           LL_RCC_SYS_CLKSOURCE_STATUS_CSI,
                                           timeout_ms)) {
            g_uni_hal_rcc_status.sys_inited = true;
            SystemCoreClockUpdate();
            return true;
        }
    }

    g_uni_hal_rcc_status.sys_inited = false;
    return false;
}


static void _uni_hal_stm_rcc_css_request_recovery(void) {
    if (!g_uni_hal_rcc_css_event_latched) {
        g_uni_hal_rcc_status.css_fault_count++;
    }

    g_uni_hal_rcc_css_event_latched = true;
    g_uni_hal_rcc_status.css_fault = true;
    g_uni_hal_rcc_status.css_recovery_pending = true;

    g_uni_hal_rcc_status.hse_inited = false;
    g_uni_hal_rcc_status.pll_inited[0] = false;
    g_uni_hal_rcc_status.pll_inited[1] = false;
    g_uni_hal_rcc_status.pll_inited[2] = false;
    g_uni_hal_rcc_status.sys_inited = false;
}


static void _uni_hal_stm_rcc_reset(void){
    bool const css_fault = g_uni_hal_rcc_status.css_fault;
    bool const css_recovery_pending = g_uni_hal_rcc_status.css_recovery_pending;
    uint32_t const css_fault_count = g_uni_hal_rcc_status.css_fault_count;

    memset(&g_uni_hal_rcc_status, 0, sizeof(g_uni_hal_rcc_status));

    g_uni_hal_rcc_status.css_fault = css_fault;
    g_uni_hal_rcc_status.css_recovery_pending = css_recovery_pending;
    g_uni_hal_rcc_status.css_fault_count = css_fault_count;

    g_uni_hal_rcc_css_nmi_processing = false;
    g_uni_hal_rcc_css_event_latched = false;
}

/**
 * Configure high speed external clock
 * @param ctx RCC context
 * @return true on success
 */
static bool _uni_hal_stm_rcc_hse(void) {
    bool result = false;

    for (uint32_t retry = 0U; retry < 3U && !result; retry++) {
        LL_RCC_HSE_Disable();
        (void)_uni_hal_stm_rcc_wait_ready(LL_RCC_HSE_IsReady, false, g_uni_hal_rcc_config->timeout.hse);
        LL_RCC_HSE_DisableBypass();

        if (g_uni_hal_rcc_config->hse_bypass != false) {
            LL_RCC_HSE_EnableBypass();
        }

        LL_RCC_ClearFlag_HSECSS();
        LL_RCC_HSE_Enable();
        result = _uni_hal_stm_rcc_wait_ready(LL_RCC_HSE_IsReady, true, g_uni_hal_rcc_config->timeout.hse);
    }

    g_uni_hal_rcc_status.hse_inited = result;

    if (result) {
        if (g_uni_hal_rcc_config->hse_css) {
            g_uni_hal_rcc_css_event_latched = false;
            g_uni_hal_rcc_css_nmi_processing = false;
            LL_RCC_ClearFlag_HSECSS();
            LL_RCC_HSE_EnableCSS();
            LL_RCC_ClearFlag_HSECSS();
        }
    }
    else {
        LL_RCC_HSE_Disable();
        (void)_uni_hal_stm_rcc_wait_ready(LL_RCC_HSE_IsReady, false, g_uni_hal_rcc_config->timeout.hse);
    }

    return result;
}


static bool _uni_hal_stm_rcc_enable_and_wait(void (*enable_fn)(void),
                                              uint32_t (*is_ready_fn)(void),
                                              void (*set_trim_fn)(uint32_t),
                                              uint32_t trim_value,
                                              uint32_t timeout_ms) {
    if ((enable_fn == nullptr) || (is_ready_fn == nullptr)) {
        return false;
    }

    enable_fn();
    if (set_trim_fn != nullptr) {
        set_trim_fn(trim_value);
    }

    return _uni_hal_stm_rcc_wait_ready(is_ready_fn, true, timeout_ms);
}


static bool _uni_hal_stm_rcc_csi(void) {
    g_uni_hal_rcc_status.csi_inited = _uni_hal_stm_rcc_enable_and_wait(LL_RCC_CSI_Enable,
                                                                        LL_RCC_CSI_IsReady,
                                                                        LL_RCC_CSI_SetCalibTrimming,
                                                                        16U,
                                                                        g_uni_hal_rcc_config->timeout.csi);

    return g_uni_hal_rcc_status.csi_inited;
}


/**
 * Configure high speed internal clock
 * @param ctx RCC context
 * @return true on success
 */
static bool _uni_hal_stm_rcc_hsi(void) {
    g_uni_hal_rcc_status.hsi_inited = _uni_hal_stm_rcc_enable_and_wait(LL_RCC_HSI_Enable,
                                                                        LL_RCC_HSI_IsReady,
                                                                        LL_RCC_HSI_SetCalibTrimming,
                                                                        64U,
                                                                        g_uni_hal_rcc_config->timeout.hsi);

    return g_uni_hal_rcc_status.hsi_inited;
}



/**
 * Configure low speed external clockAHBPrescTable
 * @param ctx RCC context
 * @return true on success
 */
static bool _uni_hal_stm_rcc_lse(void) {
    // Check LSE_IsReady flag
    g_uni_hal_rcc_status.lse_inited = LL_RCC_LSE_IsReady();

    if (!g_uni_hal_rcc_status.lse_inited) {
        uni_hal_pwr_stm_set_backup_access(true);
        LL_RCC_LSE_SetDriveCapability(LL_RCC_LSEDRIVE_MEDIUMLOW);
        LL_RCC_LSE_Enable();

        bool lse_ready = _uni_hal_stm_rcc_wait_ready(LL_RCC_LSE_IsReady,
                                                     true,
                                                     g_uni_hal_rcc_config->timeout.lse);
        uni_hal_pwr_stm_set_backup_access(false);

