Uni-Libraries/Uni.HAL/src/rcc/uni_hal_rcc_stm32h7.c
        // Check LSE_IsReady flag
        g_uni_hal_rcc_status.lse_inited = lse_ready && (LL_RCC_LSE_IsReady() != 0U);

        // Try one time to reset Backup Domain and init LSE again
        if (!g_uni_hal_rcc_status.lse_inited && !g_uni_hal_rcc_status.lse_backup_reseted) {
            uni_hal_rcc_reset(UNI_HAL_RCC_RESET_BACKUP);
            g_uni_hal_rcc_status.lse_backup_reseted = true;
            g_uni_hal_rcc_status.lse_inited = _uni_hal_stm_rcc_lse();
        }
    }

    return g_uni_hal_rcc_status.lse_inited;
}


/**
 * Configure low speed internal clock
 * @param ctx RCC context
 * @return true on success
 */
static bool _uni_hal_stm_rcc_lsi(void) {
    g_uni_hal_rcc_status.lsi_inited = _uni_hal_stm_rcc_enable_and_wait(LL_RCC_LSI_Enable,
                                                                        LL_RCC_LSI_IsReady,
                                                                        nullptr,
                                                                        0U,
                                                                        g_uni_hal_rcc_config->timeout.lsi);

    return g_uni_hal_rcc_status.lsi_inited;
}


static bool _uni_hal_stm_rcc_pll_reset(void){
    // disable PLLs
    LL_RCC_PLL1_Disable();
    LL_RCC_PLL2_Disable();
    LL_RCC_PLL3_Disable();

    // wait for ready
    if (!_uni_hal_stm_rcc_wait_ready(LL_RCC_PLL1_IsReady, false, g_uni_hal_rcc_config->timeout.pll)) {
        return false;
    }
    if (!_uni_hal_stm_rcc_wait_ready(LL_RCC_PLL2_IsReady, false, g_uni_hal_rcc_config->timeout.pll)) {
        return false;
    }
    if (!_uni_hal_stm_rcc_wait_ready(LL_RCC_PLL3_IsReady, false, g_uni_hal_rcc_config->timeout.pll)) {
        return false;
    }

    LL_RCC_PLL1P_Disable();
    LL_RCC_PLL1Q_Disable();
    LL_RCC_PLL1R_Disable();
    LL_RCC_PLL2P_Disable();
    LL_RCC_PLL2Q_Disable();
    LL_RCC_PLL2R_Disable();
    LL_RCC_PLL3P_Disable();
    LL_RCC_PLL3Q_Disable();
    LL_RCC_PLL3R_Disable();

    LL_RCC_PLL1FRACN_Disable();
    LL_RCC_PLL2FRACN_Disable();
    LL_RCC_PLL3FRACN_Disable();

    // common
    LL_RCC_WriteReg(PLLCKSELR, RCC_PLLCKSELR_DIVM1_5 | RCC_PLLCKSELR_DIVM2_5 | RCC_PLLCKSELR_DIVM3_5);
    LL_RCC_WriteReg(PLLCFGR, 0x01FF0000U);

    // pll 1
    LL_RCC_WriteReg(PLL1DIVR, 0x01010280U);
    CLEAR_REG(RCC->PLL1FRACR);

    // pll 2
    LL_RCC_WriteReg(PLL2DIVR, 0x01010280U);
    CLEAR_REG(RCC->PLL2FRACR);

    // pll 3
    LL_RCC_WriteReg(PLL3DIVR, 0x01010280U);
    CLEAR_REG(RCC->PLL3FRACR);

    return true;
}

/**
 * Configure phase locked loops
 * @param ctx RCC context
 * @return true on success
 */
static bool _uni_hal_stm_rcc_pll(void) {
    uint32_t clock_source = LL_RCC_PLLSOURCE_HSI;
    uint32_t source_hz = HSI_VALUE;

    if (g_uni_hal_rcc_status.hse_inited) {
        clock_source = LL_RCC_PLLSOURCE_HSE;
        source_hz = HSE_VALUE;
    }
    else if (g_uni_hal_rcc_status.csi_inited) {
        clock_source = LL_RCC_PLLSOURCE_CSI;
        source_hz = CSI_VALUE;
    }
    else if (g_uni_hal_rcc_status.hsi_inited) {
        clock_source = LL_RCC_PLLSOURCE_HSI;
        source_hz = HSI_VALUE;
    }
    else {
        return false;
    }

    if (!_uni_hal_stm_rcc_pll_reset()) {
        return false;
    }

    LL_RCC_PLL_SetSource(clock_source);

    bool result = true;

    // PLL1
    {
        uint32_t const pll_m = g_uni_hal_rcc_config->pll[0].m;
        if ((pll_m == 0U) || (pll_m > 63U)) {
            g_uni_hal_rcc_status.pll_inited[0] = false;
            result = false;
        }
        else {
            uint32_t const pll_input_range = _uni_hal_stm_rcc_get_pll_input_range(source_hz / pll_m);

            if (g_uni_hal_rcc_config->pll[0].p != 0U) {
                LL_RCC_PLL1P_Enable();
                LL_RCC_PLL1_SetP(g_uni_hal_rcc_config->pll[0].p);
            }
            if (g_uni_hal_rcc_config->pll[0].q != 0U) {
                LL_RCC_PLL1Q_Enable();
                LL_RCC_PLL1_SetQ(g_uni_hal_rcc_config->pll[0].q);
            }
            if (g_uni_hal_rcc_config->pll[0].r != 0U) {
                LL_RCC_PLL1R_Enable();
                LL_RCC_PLL1_SetR(g_uni_hal_rcc_config->pll[0].r);
            }

            LL_RCC_PLL1_SetVCOInputRange(pll_input_range);
            LL_RCC_PLL1_SetVCOOutputRange(LL_RCC_PLLVCORANGE_WIDE);
            LL_RCC_PLL1_SetM(pll_m);
            LL_RCC_PLL1_SetN(g_uni_hal_rcc_config->pll[0].n);

            if (g_uni_hal_rcc_config->pll[0].fracn != 0U) {
                LL_RCC_PLL1_SetFRACN(g_uni_hal_rcc_config->pll[0].fracn);
                LL_RCC_PLL1FRACN_Enable();
            }

            LL_RCC_PLL1_Enable();
            g_uni_hal_rcc_status.pll_inited[0] = _uni_hal_stm_rcc_wait_ready(LL_RCC_PLL1_IsReady,
                                                                              true,
                                                                              g_uni_hal_rcc_config->timeout.pll);
            result = result && g_uni_hal_rcc_status.pll_inited[0];
        }
    }

    // PLL2
    {
        bool start_pll_2 = false;
        if (g_uni_hal_rcc_config->pll[1].p != 0U) {
            LL_RCC_PLL2P_Enable();
            LL_RCC_PLL2_SetP(g_uni_hal_rcc_config->pll[1].p);
            start_pll_2 = true;
        }
        if (g_uni_hal_rcc_config->pll[1].q != 0U) {
            LL_RCC_PLL2Q_Enable();
            LL_RCC_PLL2_SetQ(g_uni_hal_rcc_config->pll[1].q);
            start_pll_2 = true;
        }
        if (g_uni_hal_rcc_config->pll[1].r != 0U) {
            LL_RCC_PLL2R_Enable();
            LL_RCC_PLL2_SetR(g_uni_hal_rcc_config->pll[1].r);
            start_pll_2 = true;
        }

        if (start_pll_2) {
            uint32_t const pll_m = g_uni_hal_rcc_config->pll[1].m;
            if ((pll_m == 0U) || (pll_m > 63U)) {
                g_uni_hal_rcc_status.pll_inited[1] = false;
                result = false;
            }
            else {
                uint32_t const pll_input_range = _uni_hal_stm_rcc_get_pll_input_range(source_hz / pll_m);

