Uni-Libraries/Uni.HAL/src/rcc/uni_hal_rcc_stm32h7.c
                LL_RCC_PLL2_SetVCOInputRange(pll_input_range);
                LL_RCC_PLL2_SetVCOOutputRange(LL_RCC_PLLVCORANGE_WIDE);
                LL_RCC_PLL2_SetM(pll_m);
                LL_RCC_PLL2_SetN(g_uni_hal_rcc_config->pll[1].n);

                if (g_uni_hal_rcc_config->pll[1].fracn != 0U) {
                    LL_RCC_PLL2_SetFRACN(g_uni_hal_rcc_config->pll[1].fracn);
                    LL_RCC_PLL2FRACN_Enable();
                }

                LL_RCC_PLL2_Enable();
                g_uni_hal_rcc_status.pll_inited[1] = _uni_hal_stm_rcc_wait_ready(LL_RCC_PLL2_IsReady,
                                                                                  true,
                                                                                  g_uni_hal_rcc_config->timeout.pll);
                result = result && g_uni_hal_rcc_status.pll_inited[1];
            }
        }
        else {
            g_uni_hal_rcc_status.pll_inited[1] = false;
        }
    }

    // PLL3
    {
        bool start_pll_3 = false;
        if (g_uni_hal_rcc_config->pll[2].p != 0U) {
            LL_RCC_PLL3P_Enable();
            LL_RCC_PLL3_SetP(g_uni_hal_rcc_config->pll[2].p);
            start_pll_3 = true;
        }
        if (g_uni_hal_rcc_config->pll[2].q != 0U) {
            LL_RCC_PLL3Q_Enable();
            LL_RCC_PLL3_SetQ(g_uni_hal_rcc_config->pll[2].q);
            start_pll_3 = true;
        }
        if (g_uni_hal_rcc_config->pll[2].r != 0U) {
            LL_RCC_PLL3R_Enable();
            LL_RCC_PLL3_SetR(g_uni_hal_rcc_config->pll[2].r);
            start_pll_3 = true;
        }

        if (start_pll_3) {
            uint32_t const pll_m = g_uni_hal_rcc_config->pll[2].m;
            if ((pll_m == 0U) || (pll_m > 63U)) {
                g_uni_hal_rcc_status.pll_inited[2] = false;
                result = false;
            }
            else {
                uint32_t const pll_input_range = _uni_hal_stm_rcc_get_pll_input_range(source_hz / pll_m);

                LL_RCC_PLL3_SetVCOInputRange(pll_input_range);
                LL_RCC_PLL3_SetVCOOutputRange(LL_RCC_PLLVCORANGE_WIDE);
                LL_RCC_PLL3_SetM(pll_m);
                LL_RCC_PLL3_SetN(g_uni_hal_rcc_config->pll[2].n);

                if (g_uni_hal_rcc_config->pll[2].fracn != 0U) {
                    LL_RCC_PLL3_SetFRACN(g_uni_hal_rcc_config->pll[2].fracn);
                    LL_RCC_PLL3FRACN_Enable();
                }

                LL_RCC_PLL3_Enable();
                g_uni_hal_rcc_status.pll_inited[2] = _uni_hal_stm_rcc_wait_ready(LL_RCC_PLL3_IsReady,
                                                                                  true,
                                                                                  g_uni_hal_rcc_config->timeout.pll);
                result = result && g_uni_hal_rcc_status.pll_inited[2];
            }
        }
        else {
            g_uni_hal_rcc_status.pll_inited[2] = false;
        }
    }

    if (!result) {
        LL_RCC_PLL1_Disable();
        LL_RCC_PLL2_Disable();
        LL_RCC_PLL3_Disable();
    }

    return result;
}

/**
 * Configure device system clock
 * @param ctx RCC context
 * @return true on success
 */
static bool _uni_hal_stm_rcc_sysclk(void) {
    uint32_t clock_source;
    uint32_t clock_source_status;
    uint32_t target_sysclk_hz = 0U;

    if (g_uni_hal_rcc_status.pll_inited[0]) {
        LL_PLL_ClocksTypeDef pll1_clocks = { 0 };
        LL_RCC_GetPLL1ClockFreq(&pll1_clocks);

        clock_source = LL_RCC_SYS_CLKSOURCE_PLL1;
        clock_source_status = LL_RCC_SYS_CLKSOURCE_STATUS_PLL1;
        target_sysclk_hz = pll1_clocks.PLL_P_Frequency;
    } else if (g_uni_hal_rcc_status.hse_inited) {
        clock_source = LL_RCC_SYS_CLKSOURCE_HSE;
        clock_source_status = LL_RCC_SYS_CLKSOURCE_STATUS_HSE;
        target_sysclk_hz = HSE_VALUE;
    } else if (g_uni_hal_rcc_status.csi_inited) {
        clock_source = LL_RCC_SYS_CLKSOURCE_CSI;
        clock_source_status = LL_RCC_SYS_CLKSOURCE_STATUS_CSI;
        target_sysclk_hz = CSI_VALUE;
    } else if (g_uni_hal_rcc_status.hsi_inited) {
        clock_source = LL_RCC_SYS_CLKSOURCE_HSI;
        clock_source_status = LL_RCC_SYS_CLKSOURCE_STATUS_HSI;
        target_sysclk_hz = HSI_VALUE >> (LL_RCC_HSI_GetDivider() >> RCC_CR_HSIDIV_Pos);
    }
    else{
        return false;
    }

    uint32_t const sys_prescaler = LL_RCC_SYSCLK_DIV_1;
    uint32_t const ahb_prescaler = LL_RCC_AHB_DIV_2;
    uint32_t const apb1_prescaler = LL_RCC_APB1_DIV_2;
    uint32_t const apb2_prescaler = LL_RCC_APB2_DIV_2;
    uint32_t const apb3_prescaler = LL_RCC_APB3_DIV_2;
    uint32_t const apb4_prescaler = LL_RCC_APB4_DIV_2;

    if (target_sysclk_hz == 0U) {
        g_uni_hal_rcc_status.sys_inited = false;
        return false;
    }

    uint32_t const target_cpuclk_hz = LL_RCC_CALC_SYSCLK_FREQ(target_sysclk_hz, sys_prescaler);
    uint32_t const target_axi_hz = LL_RCC_CALC_HCLK_FREQ(target_sysclk_hz, ahb_prescaler);
    if ((target_cpuclk_hz == 0U) || (target_axi_hz == 0U)) {
        g_uni_hal_rcc_status.sys_inited = false;
        return false;
    }

    if (!uni_hal_flash_configure_latency_auto(target_axi_hz)) {
        g_uni_hal_rcc_status.sys_inited = false;
        return false;
    }

    // set prescalers
    LL_RCC_SetSysPrescaler(sys_prescaler);
    LL_RCC_SetAHBPrescaler(ahb_prescaler);
    LL_RCC_SetAPB1Prescaler(apb1_prescaler);
    LL_RCC_SetAPB2Prescaler(apb2_prescaler);
    LL_RCC_SetAPB3Prescaler(apb3_prescaler);
    LL_RCC_SetAPB4Prescaler(apb4_prescaler);

    // Reconfigure sysclk
    if (!_uni_hal_stm_rcc_switch_sysclk(clock_source, clock_source_status, g_uni_hal_rcc_config->timeout.pll)) {
        g_uni_hal_rcc_status.sys_inited = false;
        return false;
    }

    g_uni_hal_rcc_status.sys_inited = true;

    // Recalculate clock
    SystemCoreClockUpdate();

    return true;
}



bool uni_hal_rcc_init(void) {
    bool result = false;

    if ((g_uni_hal_rcc_config == nullptr) || g_uni_hal_rcc_status.inited) {
        return g_uni_hal_rcc_status.inited;
    }

