Uni-Libraries/Uni.HAL/src/rcc/uni_hal_rcc_stm32h7.c
    if (g_uni_hal_rcc_reconfig_in_progress) {
        return false;
    }

    g_uni_hal_rcc_reconfig_in_progress = true;

    if (g_uni_hal_rcc_config != nullptr && !g_uni_hal_rcc_status.inited) {
        g_uni_hal_rcc_status.css_recovery_pending = false;
        g_uni_hal_rcc_css_event_latched = false;

        _uni_hal_stm_rcc_reset();
        g_uni_hal_rcc_reset_flags_shadow = RCC->RSR;

        if (!uni_hal_dwt_is_inited()) {
            (void)uni_hal_dwt_init();
        }

        result = uni_hal_rcc_clk_set(UNI_HAL_CORE_PERIPH_SYSCFG, true);
        (void)uni_hal_rcc_clk_set(UNI_HAL_CORE_PERIPH_PWR, true);
        if (!result) {
            g_uni_hal_rcc_boot_stage = UNI_HAL_RCC_BOOT_STAGE_NONE;
            _uni_hal_stm_rcc_diag_capture(&g_uni_hal_rcc_diag_boot);
            g_uni_hal_rcc_status.inited = false;
            g_uni_hal_rcc_reconfig_in_progress = false;
            return g_uni_hal_rcc_status.inited;
        }

        SystemCoreClockUpdate();
        uni_hal_systick_init();

        g_uni_hal_rcc_boot_stage = UNI_HAL_RCC_BOOT_STAGE_HSE;
        if(g_uni_hal_rcc_config->hse_enable) {
            (void)_uni_hal_stm_rcc_hse();
        }

        g_uni_hal_rcc_boot_stage = UNI_HAL_RCC_BOOT_STAGE_CSI;
        if(g_uni_hal_rcc_config->csi_enable) {
            (void)_uni_hal_stm_rcc_csi();
        }

        g_uni_hal_rcc_boot_stage = UNI_HAL_RCC_BOOT_STAGE_HSI;
        (void)_uni_hal_stm_rcc_hsi();

        if(g_uni_hal_rcc_config->lse_enable != false) {
            (void)_uni_hal_stm_rcc_lse();
        }
        if (!g_uni_hal_rcc_status.lse_inited) {
            (void)_uni_hal_stm_rcc_lsi();
        }

        g_uni_hal_rcc_boot_stage = UNI_HAL_RCC_BOOT_STAGE_PLL;
        bool pll_ok = _uni_hal_stm_rcc_pll();

        g_uni_hal_rcc_boot_stage = UNI_HAL_RCC_BOOT_STAGE_SYSCLK;
        if (pll_ok) {
            result = _uni_hal_stm_rcc_sysclk() && result;
        }

        if (!result || !pll_ok || !g_uni_hal_rcc_status.sys_inited) {
            result = _uni_hal_stm_rcc_fallback_to_safe_clk(g_uni_hal_rcc_config->timeout.hsi);
        }

        uni_hal_systick_init();
        _uni_hal_stm_rcc_diag_capture(&g_uni_hal_rcc_diag_boot);
        g_uni_hal_rcc_boot_stage = UNI_HAL_RCC_BOOT_STAGE_NONE;

        g_uni_hal_rcc_status.inited = result && g_uni_hal_rcc_status.sys_inited;
    }

    g_uni_hal_rcc_reconfig_in_progress = false;
    return g_uni_hal_rcc_status.inited;
}


bool uni_hal_rcc_is_inited(void) {
    return g_uni_hal_rcc_status.inited;
}


bool uni_hal_rcc_reset(uni_hal_rcc_reset_target_e target) {
    bool result = false;

    switch (target) {
        case UNI_HAL_RCC_RESET_BACKUP:
            uni_hal_pwr_stm_set_backup_access(true);
            LL_RCC_ForceBackupDomainReset();
            LL_RCC_ReleaseBackupDomainReset();
            uni_hal_pwr_stm_set_backup_access(false);
            g_uni_hal_rcc_status.lse_backup_reseted = true;
            result = true;
            break;
        default:
            // unknown reset
            break;
    }


    return result;
}


//
// Clock
//

/**
 * Get HCLK frequency
 * @return HCLK frequency in hertz
 */
uint32_t uni_hal_rcc_stm32h7_clk_get_hclk(void) {
    // get HCLK freq
    LL_RCC_ClocksTypeDef clocks;
    LL_RCC_GetSystemClocksFreq(&clocks);
    return clocks.HCLK_Frequency;
}


bool uni_hal_rcc_clk_get(uni_hal_core_periph_e clock) { //-V2008
    bool result = false;

    switch (clock) {
        case UNI_HAL_CORE_PERIPH_ADC_1:
        case UNI_HAL_CORE_PERIPH_ADC_2:
            result = LL_AHB1_GRP1_IsEnabledClock(LL_AHB1_GRP1_PERIPH_ADC12);
            break;
        case UNI_HAL_CORE_PERIPH_ADC_3:
            result = LL_AHB4_GRP1_IsEnabledClock(LL_AHB4_GRP1_PERIPH_ADC3);
            break;
        case UNI_HAL_CORE_PERIPH_CAN_1:
        case UNI_HAL_CORE_PERIPH_CAN_2:
            result = LL_APB1_GRP2_IsEnabledClock(LL_APB1_GRP2_PERIPH_FDCAN);
            break;
        case UNI_HAL_CORE_PERIPH_CRC_1:
            result = LL_AHB4_GRP1_IsEnabledClock(LL_AHB4_GRP1_PERIPH_CRC);
            break;
        case UNI_HAL_CORE_PERIPH_DAC_1:
        case UNI_HAL_CORE_PERIPH_DAC_2:
            result = LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_DAC12);
            break;
        case UNI_HAL_CORE_PERIPH_DMA_1:
            result = LL_AHB1_GRP1_IsEnabledClock(LL_AHB1_GRP1_PERIPH_DMA1);
            break;
        case UNI_HAL_CORE_PERIPH_DMA_2:
            result = LL_AHB1_GRP1_IsEnabledClock(LL_AHB1_GRP1_PERIPH_DMA2);
            break;
        case UNI_HAL_CORE_PERIPH_GPIO_A:
            result = LL_AHB4_GRP1_IsEnabledClock(LL_AHB4_GRP1_PERIPH_GPIOA);
            break;
        case UNI_HAL_CORE_PERIPH_GPIO_B:
            result = LL_AHB4_GRP1_IsEnabledClock(LL_AHB4_GRP1_PERIPH_GPIOB);
            break;
        case UNI_HAL_CORE_PERIPH_GPIO_C:
            result = LL_AHB4_GRP1_IsEnabledClock(LL_AHB4_GRP1_PERIPH_GPIOC);
            break;
        case UNI_HAL_CORE_PERIPH_GPIO_D:
            result = LL_AHB4_GRP1_IsEnabledClock(LL_AHB4_GRP1_PERIPH_GPIOD);
            break;
        case UNI_HAL_CORE_PERIPH_GPIO_E:
            result = LL_AHB4_GRP1_IsEnabledClock(LL_AHB4_GRP1_PERIPH_GPIOE);
            break;
        case UNI_HAL_CORE_PERIPH_GPIO_F:
            result = LL_AHB4_GRP1_IsEnabledClock(LL_AHB4_GRP1_PERIPH_GPIOF);
            break;
        case UNI_HAL_CORE_PERIPH_GPIO_G:
            result = LL_AHB4_GRP1_IsEnabledClock(LL_AHB4_GRP1_PERIPH_GPIOG);
            break;
        case UNI_HAL_CORE_PERIPH_GPIO_H:
            result = LL_AHB4_GRP1_IsEnabledClock(LL_AHB4_GRP1_PERIPH_GPIOH);
            break;
        case UNI_HAL_CORE_PERIPH_GPIO_I:
            result = LL_AHB4_GRP1_IsEnabledClock(LL_AHB4_GRP1_PERIPH_GPIOI);
            break;
        case UNI_HAL_CORE_PERIPH_I2C_1:
            result = LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_I2C1);
            break;
        case UNI_HAL_CORE_PERIPH_I2C_2:
            result = LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_I2C2);
            break;
        case UNI_HAL_CORE_PERIPH_I2C_3:
            result = LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_I2C3);
            break;
        case UNI_HAL_CORE_PERIPH_I2C_4:
            result = LL_APB4_GRP1_IsEnabledClock(LL_APB4_GRP1_PERIPH_I2C4);
            break;
        case UNI_HAL_CORE_PERIPH_RNG:
            result = LL_AHB2_GRP1_IsEnabledClock(LL_AHB2_GRP1_PERIPH_RNG);
            break;
        case UNI_HAL_CORE_PERIPH_RTC:
            result = LL_RCC_IsEnabledRTC();
            break;
        case UNI_HAL_CORE_PERIPH_SPI_1:
            result = LL_APB2_GRP1_IsEnabledClock(LL_APB2_GRP1_PERIPH_SPI1);
            break;
        case UNI_HAL_CORE_PERIPH_SPI_2:
            result = LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_SPI2);
            break;
        case UNI_HAL_CORE_PERIPH_SPI_3:
            result = LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_SPI3);
            break;
        case UNI_HAL_CORE_PERIPH_SPI_4:
            result = LL_APB2_GRP1_IsEnabledClock(LL_APB2_GRP1_PERIPH_SPI4);
            break;
        case UNI_HAL_CORE_PERIPH_SPI_5:
            result = LL_APB2_GRP1_IsEnabledClock(LL_APB2_GRP1_PERIPH_SPI5);
            break;
        case UNI_HAL_CORE_PERIPH_SPI_6:
            result = LL_APB4_GRP1_IsEnabledClock(LL_APB4_GRP1_PERIPH_SPI6);
            break;
        case UNI_HAL_CORE_PERIPH_TIM_1:
            result = LL_APB2_GRP1_IsEnabledClock(LL_APB2_GRP1_PERIPH_TIM1);
            break;
        case UNI_HAL_CORE_PERIPH_TIM_2:
            result = LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_TIM2);
            break;
        case UNI_HAL_CORE_PERIPH_TIM_3:
            result = LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_TIM3);
            break;
        case UNI_HAL_CORE_PERIPH_TIM_4:
            result = LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_TIM4);
            break;
        case UNI_HAL_CORE_PERIPH_TIM_5:
            result = LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_TIM5);
            break;
        case UNI_HAL_CORE_PERIPH_TIM_6:
            result = LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_TIM6);
            break;
        case UNI_HAL_CORE_PERIPH_TIM_7:
            result = LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_TIM7);
            break;
        case UNI_HAL_CORE_PERIPH_TIM_8:
            result = LL_APB2_GRP1_IsEnabledClock(LL_APB2_GRP1_PERIPH_TIM8);
            break;
        case UNI_HAL_CORE_PERIPH_TIM_15:
            result = LL_APB2_GRP1_IsEnabledClock(LL_APB2_GRP1_PERIPH_TIM15);
            break;
        case UNI_HAL_CORE_PERIPH_TIM_16:
            result = LL_APB2_GRP1_IsEnabledClock(LL_APB2_GRP1_PERIPH_TIM16);
            break;
        case UNI_HAL_CORE_PERIPH_TIM_17:
            result = LL_APB2_GRP1_IsEnabledClock(LL_APB2_GRP1_PERIPH_TIM17);
            break;
        case UNI_HAL_CORE_PERIPH_UART_1:
            result = LL_APB2_GRP1_IsEnabledClock(LL_APB2_GRP1_PERIPH_USART1);
            break;
        case UNI_HAL_CORE_PERIPH_UART_2:
            result = LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_USART2);
            break;
        case UNI_HAL_CORE_PERIPH_UART_3:
            result = LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_USART3);
            break;
        case UNI_HAL_CORE_PERIPH_UART_4:
            result = LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_UART4);
            break;
        case UNI_HAL_CORE_PERIPH_UART_5:
            result = LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_UART5);
            break;
        case UNI_HAL_CORE_PERIPH_PWR:
            result = true;
            break;
        case UNI_HAL_CORE_PERIPH_SYSCFG:
            result = LL_APB4_GRP1_IsEnabledClock(LL_APB4_GRP1_PERIPH_SYSCFG);
            break;
        case UNI_HAL_CORE_PERIPH_TIM_9:
        case UNI_HAL_CORE_PERIPH_TIM_10:
        case UNI_HAL_CORE_PERIPH_TIM_11:
        case UNI_HAL_CORE_PERIPH_TIM_12:
        case UNI_HAL_CORE_PERIPH_TIM_13:
        case UNI_HAL_CORE_PERIPH_TIM_14:
        default:
            // unknown or not implemented periph
            break;
    }

    return result;
}


