Uni-Libraries/Uni.HAL/src/rcc/uni_hal_rcc_stm32h7.c
bool uni_hal_rcc_clk_set(uni_hal_core_periph_e target, bool state) { //-V2008
    bool result = false;

    result = true;
    if (state != uni_hal_rcc_clk_get(target)) {
        result = false;
        switch (target) {
            case UNI_HAL_CORE_PERIPH_ADC_1:
            case UNI_HAL_CORE_PERIPH_ADC_2:
                state ? LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_ADC12) : LL_AHB1_GRP1_DisableClock(
                        LL_AHB1_GRP1_PERIPH_ADC12);
                result = true;
                break;
            case UNI_HAL_CORE_PERIPH_ADC_3:
                state ? LL_AHB4_GRP1_EnableClock(LL_AHB4_GRP1_PERIPH_ADC3) : LL_AHB4_GRP1_DisableClock(
                        LL_AHB4_GRP1_PERIPH_ADC3);
                result = true;
                break;
            case UNI_HAL_CORE_PERIPH_CAN_1:
            case UNI_HAL_CORE_PERIPH_CAN_2:
                state ? LL_APB1_GRP2_EnableClock(LL_APB1_GRP2_PERIPH_FDCAN) : LL_APB1_GRP2_DisableClock(LL_APB1_GRP2_PERIPH_FDCAN);
                result = true;
                break;
            case UNI_HAL_CORE_PERIPH_CRC_1:
                state ? LL_AHB4_GRP1_EnableClock(LL_AHB4_GRP1_PERIPH_CRC) : LL_AHB4_GRP1_DisableClock(
                        LL_AHB4_GRP1_PERIPH_CRC);
                result = true;
                break;
            case UNI_HAL_CORE_PERIPH_DAC_1:
            case UNI_HAL_CORE_PERIPH_DAC_2:
                state ? LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_DAC12) : LL_APB1_GRP1_DisableClock(
                        LL_APB1_GRP1_PERIPH_DAC12);
                result = true;
                break;
            case UNI_HAL_CORE_PERIPH_DMA_1:
                state ? LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_DMA1) : LL_AHB1_GRP1_DisableClock(
                        LL_AHB1_GRP1_PERIPH_DMA1);
                result = true;
                break;
            case UNI_HAL_CORE_PERIPH_DMA_2:
                state ? LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_DMA2) : LL_AHB1_GRP1_DisableClock(
                        LL_AHB1_GRP1_PERIPH_DMA2);
                result = true;
                break;
            case UNI_HAL_CORE_PERIPH_ETH_1:
                state ? LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_ETH1MAC) : LL_AHB1_GRP1_DisableClock(
                        LL_AHB1_GRP1_PERIPH_ETH1MAC);
                state ? LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_ETH1RX) : LL_AHB1_GRP1_DisableClock(
                        LL_AHB1_GRP1_PERIPH_ETH1RX);
                state ? LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_ETH1TX) : LL_AHB1_GRP1_DisableClock(
                        LL_AHB1_GRP1_PERIPH_ETH1TX);
                result = true;
                break;
            case UNI_HAL_CORE_PERIPH_GPIO_A:
                state ? LL_AHB4_GRP1_EnableClock(LL_AHB4_GRP1_PERIPH_GPIOA) : LL_AHB4_GRP1_DisableClock(
                        LL_AHB4_GRP1_PERIPH_GPIOA);
                result = true;
                break;
            case UNI_HAL_CORE_PERIPH_GPIO_B:
                state ? LL_AHB4_GRP1_EnableClock(LL_AHB4_GRP1_PERIPH_GPIOB) : LL_AHB4_GRP1_DisableClock(
                        LL_AHB4_GRP1_PERIPH_GPIOB);
                result = true;
                break;
            case UNI_HAL_CORE_PERIPH_GPIO_C:
                state ? LL_AHB4_GRP1_EnableClock(LL_AHB4_GRP1_PERIPH_GPIOC) : LL_AHB4_GRP1_DisableClock(
                        LL_AHB4_GRP1_PERIPH_GPIOC);
                result = true;
                break;
            case UNI_HAL_CORE_PERIPH_GPIO_D:
                state ? LL_AHB4_GRP1_EnableClock(LL_AHB4_GRP1_PERIPH_GPIOD) : LL_AHB4_GRP1_DisableClock(
                        LL_AHB4_GRP1_PERIPH_GPIOD);
                result = true;
                break;
            case UNI_HAL_CORE_PERIPH_GPIO_E:
                state ? LL_AHB4_GRP1_EnableClock(LL_AHB4_GRP1_PERIPH_GPIOE) : LL_AHB4_GRP1_DisableClock(
                        LL_AHB4_GRP1_PERIPH_GPIOE);
                result = true;
                break;
            case UNI_HAL_CORE_PERIPH_GPIO_F:
                state ? LL_AHB4_GRP1_EnableClock(LL_AHB4_GRP1_PERIPH_GPIOF) : LL_AHB4_GRP1_DisableClock(
                        LL_AHB4_GRP1_PERIPH_GPIOF);
                result = true;
                break;
            case UNI_HAL_CORE_PERIPH_GPIO_G:
                state ? LL_AHB4_GRP1_EnableClock(LL_AHB4_GRP1_PERIPH_GPIOG) : LL_AHB4_GRP1_DisableClock(
                        LL_AHB4_GRP1_PERIPH_GPIOG);
                result = true;
                break;
            case UNI_HAL_CORE_PERIPH_GPIO_H:
                state ? LL_AHB4_GRP1_EnableClock(LL_AHB4_GRP1_PERIPH_GPIOH) : LL_AHB4_GRP1_DisableClock(
                        LL_AHB4_GRP1_PERIPH_GPIOH);
                result = true;
                break;
            case UNI_HAL_CORE_PERIPH_GPIO_I:
                state ? LL_AHB4_GRP1_EnableClock(LL_AHB4_GRP1_PERIPH_GPIOI) : LL_AHB4_GRP1_DisableClock(
                        LL_AHB4_GRP1_PERIPH_GPIOI);
                result = true;
                break;
            case UNI_HAL_CORE_PERIPH_I2C_1:
                state ? LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_I2C1) : LL_APB1_GRP1_DisableClock(
                        LL_APB1_GRP1_PERIPH_I2C1);
                result = true;
                break;
            case UNI_HAL_CORE_PERIPH_I2C_2:
                state ? LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_I2C2) : LL_APB1_GRP1_DisableClock(
                        LL_APB1_GRP1_PERIPH_I2C2);
                result = true;
                break;
            case UNI_HAL_CORE_PERIPH_I2C_3:
                state ? LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_I2C3) : LL_APB1_GRP1_DisableClock(
                        LL_APB1_GRP1_PERIPH_I2C3);
                result = true;
                break;
            case UNI_HAL_CORE_PERIPH_I2C_4:
                state ? LL_APB4_GRP1_EnableClock(LL_APB4_GRP1_PERIPH_I2C4) : LL_APB4_GRP1_DisableClock(
                        LL_APB4_GRP1_PERIPH_I2C4);
                result = true;
                break;
            case UNI_HAL_CORE_PERIPH_RNG:
                state ? LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_RNG) : LL_AHB2_GRP1_DisableClock(
                        LL_AHB2_GRP1_PERIPH_RNG);
                result = true;
                break;
            case UNI_HAL_CORE_PERIPH_RTC:
                uni_hal_pwr_stm_set_backup_access(true);
                state ? LL_RCC_EnableRTC() : LL_RCC_DisableRTC();
                uni_hal_pwr_stm_set_backup_access(false);
                result = true;
                break;
            case UNI_HAL_CORE_PERIPH_SPI_1:
                state ? LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_SPI1) : LL_APB2_GRP1_DisableClock(
                        LL_APB2_GRP1_PERIPH_SPI1);
                result = true;
                break;
            case UNI_HAL_CORE_PERIPH_SPI_2:
                state ? LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_SPI2) : LL_APB1_GRP1_DisableClock(
                        LL_APB1_GRP1_PERIPH_SPI2);
                result = true;
                break;
            case UNI_HAL_CORE_PERIPH_SPI_3:
                state ? LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_SPI3) : LL_APB1_GRP1_DisableClock(
                        LL_APB1_GRP1_PERIPH_SPI3);
                result = true;
                break;
            case UNI_HAL_CORE_PERIPH_SPI_4:
                state ? LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_SPI4) : LL_APB2_GRP1_DisableClock(
                        LL_APB2_GRP1_PERIPH_SPI4);
                result = true;
                break;
            case UNI_HAL_CORE_PERIPH_SPI_5:
                state ? LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_SPI5) : LL_APB2_GRP1_DisableClock(
                        LL_APB2_GRP1_PERIPH_SPI5);
                result = true;
                break;
            case UNI_HAL_CORE_PERIPH_SPI_6:
                state ? LL_APB4_GRP1_EnableClock(LL_APB4_GRP1_PERIPH_SPI6) : LL_APB4_GRP1_DisableClock(
                        LL_APB4_GRP1_PERIPH_SPI6);
                result = true;
                break;
            case UNI_HAL_CORE_PERIPH_SYSCFG:
                state ? LL_APB4_GRP1_EnableClock(LL_APB4_GRP1_PERIPH_SYSCFG) : LL_APB4_GRP1_DisableClock(
                        LL_APB4_GRP1_PERIPH_SYSCFG);
                result = true;
                break;
            case UNI_HAL_CORE_PERIPH_PWR:
                result = true;
                break;
            case UNI_HAL_CORE_PERIPH_TIM_1:
                state ? LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_TIM1) : LL_APB2_GRP1_DisableClock(
                        LL_APB2_GRP1_PERIPH_TIM1);
                result = true;
                break;
            case UNI_HAL_CORE_PERIPH_TIM_2:
                state ? LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_TIM2) : LL_APB1_GRP1_DisableClock(
                        LL_APB1_GRP1_PERIPH_TIM2);
                result = true;
                break;
            case UNI_HAL_CORE_PERIPH_TIM_3:
                state ? LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_TIM3) : LL_APB1_GRP1_DisableClock(
                        LL_APB1_GRP1_PERIPH_TIM3);
                result = true;
                break;
            case UNI_HAL_CORE_PERIPH_TIM_4:
                state ? LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_TIM4) : LL_APB1_GRP1_DisableClock(
                        LL_APB1_GRP1_PERIPH_TIM4);
                result = true;
                break;
            case UNI_HAL_CORE_PERIPH_TIM_5:
                state ? LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_TIM5) : LL_APB1_GRP1_DisableClock(
                        LL_APB1_GRP1_PERIPH_TIM5);
                result = true;
                break;
            case UNI_HAL_CORE_PERIPH_TIM_6:
                state ? LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_TIM6) : LL_APB1_GRP1_DisableClock(
                        LL_APB1_GRP1_PERIPH_TIM6);
                result = true;
                break;
            case UNI_HAL_CORE_PERIPH_TIM_7:
                state ? LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_TIM7) : LL_APB1_GRP1_DisableClock(
                        LL_APB1_GRP1_PERIPH_TIM7);
                result = true;
                break;
            case UNI_HAL_CORE_PERIPH_TIM_8:
                state ? LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_TIM8) : LL_APB2_GRP1_DisableClock(
                        LL_APB2_GRP1_PERIPH_TIM8);
                result = true;
                break;
            case UNI_HAL_CORE_PERIPH_TIM_15:
                state ? LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_TIM15) : LL_APB2_GRP1_DisableClock(
                        LL_APB2_GRP1_PERIPH_TIM15);
                result = true;
                break;
            case UNI_HAL_CORE_PERIPH_TIM_16:
                state ? LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_TIM16) : LL_APB2_GRP1_DisableClock(
                        LL_APB2_GRP1_PERIPH_TIM16);
                result = true;
                break;
            case UNI_HAL_CORE_PERIPH_TIM_17:
                state ? LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_TIM17) : LL_APB2_GRP1_DisableClock(
                        LL_APB2_GRP1_PERIPH_TIM17);
                result = true;
                break;
            case UNI_HAL_CORE_PERIPH_UART_1:
                state ? LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_USART1) : LL_APB2_GRP1_DisableClock(
                        LL_APB2_GRP1_PERIPH_USART1);
                result = true;
                break;
            case UNI_HAL_CORE_PERIPH_UART_2:
                state ? LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_USART2) : LL_APB1_GRP1_DisableClock(
                        LL_APB1_GRP1_PERIPH_USART2);
                result = true;
                break;
            case UNI_HAL_CORE_PERIPH_UART_3:
                state ? LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_USART3) : LL_APB1_GRP1_DisableClock(
                        LL_APB1_GRP1_PERIPH_USART3);
                result = true;
                break;
            case UNI_HAL_CORE_PERIPH_UART_4:
                state ? LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_UART4) : LL_APB1_GRP1_DisableClock(
                        LL_APB1_GRP1_PERIPH_UART4);
                result = true;
                break;
            case UNI_HAL_CORE_PERIPH_UART_5:
                state ? LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_UART5) : LL_APB1_GRP1_DisableClock(
                        LL_APB1_GRP1_PERIPH_UART5);
                result = true;
                break;
            case UNI_HAL_CORE_PERIPH_UART_6:
                state ? LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_USART6) : LL_APB2_GRP1_DisableClock(
                        LL_APB2_GRP1_PERIPH_USART6);
                result = true;
                break;
            case UNI_HAL_CORE_PERIPH_UART_7:
                state ? LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_UART7) : LL_APB1_GRP1_DisableClock(
                        LL_APB1_GRP1_PERIPH_UART7);
                result = true;
                break;
            case UNI_HAL_CORE_PERIPH_UART_8:
                state ? LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_UART8) : LL_APB1_GRP1_DisableClock(
                        LL_APB1_GRP1_PERIPH_UART8);
                result = true;
                break;
            case UNI_HAL_CORE_PERIPH_TIM_9:
            case UNI_HAL_CORE_PERIPH_TIM_10:
            case UNI_HAL_CORE_PERIPH_TIM_11:
            case UNI_HAL_CORE_PERIPH_TIM_12:
            case UNI_HAL_CORE_PERIPH_TIM_13:
            case UNI_HAL_CORE_PERIPH_TIM_14:
            default:
                // unknown or not implemented periph
                break;
        }
    }

    return result;
}

uint32_t uni_hal_rcc_clk_get_freq(uni_hal_core_periph_e target) {
    uint32_t result = 0U;
    switch (target) {
        case UNI_HAL_CORE_PERIPH_SYSCLK:
            result = uni_hal_rcc_stm32h7_clk_get_hclk();
            break;
        case UNI_HAL_CORE_PERIPH_SPI_1:
        case UNI_HAL_CORE_PERIPH_SPI_2:
        case UNI_HAL_CORE_PERIPH_SPI_3:
            result = LL_RCC_GetSPIClockFreq(LL_RCC_SPI123_CLKSOURCE);
            break;
        case UNI_HAL_CORE_PERIPH_SPI_4:
        case UNI_HAL_CORE_PERIPH_SPI_5:
            result = LL_RCC_GetSPIClockFreq(LL_RCC_SPI45_CLKSOURCE);
            break;
        case UNI_HAL_CORE_PERIPH_SPI_6:
            result = LL_RCC_GetSPIClockFreq(LL_RCC_SPI6_CLKSOURCE);
            break;
        case UNI_HAL_CORE_PERIPH_UART_1:
        case UNI_HAL_CORE_PERIPH_UART_6:
            result = LL_RCC_GetUSARTClockFreq(LL_RCC_USART16_CLKSOURCE);
            break;
        case UNI_HAL_CORE_PERIPH_UART_2:
        case UNI_HAL_CORE_PERIPH_UART_3:
        case UNI_HAL_CORE_PERIPH_UART_4:
        case UNI_HAL_CORE_PERIPH_UART_5:
        case UNI_HAL_CORE_PERIPH_UART_7:
        case UNI_HAL_CORE_PERIPH_UART_8:
            result = LL_RCC_GetUSARTClockFreq(LL_RCC_USART234578_CLKSOURCE);
            break;
        default:
            // unknown or not implemented periph
            break;
    }

    return result;
}


//
// Clock Source
//

uni_hal_rcc_clksrc_e uni_hal_rcc_clksrc_get(uni_hal_core_periph_e target) {
    uni_hal_rcc_clksrc_e result = UNI_HAL_RCC_CLKSRC_UNKNOWN;
    if (uni_hal_rcc_is_inited()) {
        switch (target) {
        case UNI_HAL_CORE_PERIPH_RNG:
            switch(LL_RCC_GetRNGClockSource(LL_RCC_RNG_CLKSOURCE)) {
                case LL_RCC_RNG_CLKSOURCE_HSI48:
                    result = UNI_HAL_RCC_CLKSRC_HSI48;
                    break;
                case LL_RCC_RNG_CLKSOURCE_PLL1Q:
                    result = UNI_HAL_RCC_CLKSRC_PLL1Q;
                    break;
                case LL_RCC_RNG_CLKSOURCE_LSE:
                    result = UNI_HAL_RCC_CLKSRC_LSE;
                    break;
                case LL_RCC_RNG_CLKSOURCE_LSI:
                    result = UNI_HAL_RCC_CLKSRC_LSI;
                    break;
                default:
                    // unknown clock source
                    break;
            }
            break;
        case UNI_HAL_CORE_PERIPH_RTC:
            uni_hal_pwr_stm_set_backup_access(true);
            switch (LL_RCC_GetRTCClockSource()) {
            case LL_RCC_RTC_CLKSOURCE_NONE:
                result = UNI_HAL_RCC_CLKSRC_NONE;
                break;
            case LL_RCC_RTC_CLKSOURCE_LSE:
                result = UNI_HAL_RCC_CLKSRC_LSE;
                break;
            case LL_RCC_RTC_CLKSOURCE_LSI:
                result = UNI_HAL_RCC_CLKSRC_LSI;
                break;
            case LL_RCC_RTC_CLKSOURCE_HSE:
                result = UNI_HAL_RCC_CLKSRC_HSE;
                break;
            default:
                // unknown clock source
                break;
            }
            uni_hal_pwr_stm_set_backup_access(false);
            break;
        case UNI_HAL_CORE_PERIPH_SPI_1:
        case UNI_HAL_CORE_PERIPH_SPI_2:
        case UNI_HAL_CORE_PERIPH_SPI_3:
            switch(LL_RCC_GetSPIClockSource(LL_RCC_SPI123_CLKSOURCE)){
                case LL_RCC_SPI123_CLKSOURCE_PLL1Q:
                    result = UNI_HAL_RCC_CLKSRC_PLL1Q;
                    break;
                case LL_RCC_SPI123_CLKSOURCE_PLL2P:
                    result = UNI_HAL_RCC_CLKSRC_PLL2P;
                    break;
                case LL_RCC_SPI123_CLKSOURCE_PLL3P:
                    result = UNI_HAL_RCC_CLKSRC_PLL3P;
                    break;
                case LL_RCC_SPI123_CLKSOURCE_I2S_CKIN:
                    result = UNI_HAL_RCC_CLKSRC_I2S_CKIN;
                    break;
                case LL_RCC_SPI123_CLKSOURCE_CLKP:
                    result = UNI_HAL_RCC_CLKSRC_CLKP;
                    break;
                default:
                    // unknown clock source
                    break;
            }
            break;
        default:
            // unknown periph
            break;
        }
    }
    return result;
}


bool uni_hal_rcc_clksrc_set(uni_hal_core_periph_e target, uni_hal_rcc_clksrc_e source) {
    bool result = false;

