Uni-Libraries/Uni.HAL/src/rcc/uni_hal_rcc_stm32h7.c
    if (uni_hal_rcc_is_inited()) {
        switch (target) {
            case UNI_HAL_CORE_PERIPH_ADC_1:
            case UNI_HAL_CORE_PERIPH_ADC_2:
            case UNI_HAL_CORE_PERIPH_ADC_3: {
                result = true;
                uint32_t src = 0;
                switch (source) {
                    case UNI_HAL_RCC_CLKSRC_PLL2P:
                        src = LL_RCC_ADC_CLKSOURCE_PLL2P;
                        break;
                    case UNI_HAL_RCC_CLKSRC_PLL3R:
                        src = LL_RCC_ADC_CLKSOURCE_PLL3R;
                        break;
                    case UNI_HAL_RCC_CLKSRC_CLKP:
                        src = LL_RCC_ADC_CLKSOURCE_CLKP;
                        break;
                    default:
                        result = false;
                }
                if (result) {
                    LL_RCC_SetADCClockSource(src);
                }
                break;
            }
            case UNI_HAL_CORE_PERIPH_I2C_1:
            case UNI_HAL_CORE_PERIPH_I2C_2:
            case UNI_HAL_CORE_PERIPH_I2C_3: {
                result = true;
                uint32_t src = 0;
                switch (source) {
                    case UNI_HAL_RCC_CLKSRC_PCLK1:
                        src = LL_RCC_I2C123_CLKSOURCE_PCLK1;
                        break;
                    case UNI_HAL_RCC_CLKSRC_PLL3R:
                        src = LL_RCC_I2C123_CLKSOURCE_PLL3R;
                        break;
                    case UNI_HAL_RCC_CLKSRC_HSI:
                        src = LL_RCC_I2C123_CLKSOURCE_HSI;
                        break;
                    case UNI_HAL_RCC_CLKSRC_CSI:
                        src = LL_RCC_I2C123_CLKSOURCE_CSI;
                        break;
                    default:
                        result = false;
                }
                if (result) {
                    LL_RCC_SetI2CClockSource(src);
                }
                break;
            }
            case UNI_HAL_CORE_PERIPH_I2C_4: {
                result = true;
                uint32_t src = 0;
                switch (source) {
                    case UNI_HAL_RCC_CLKSRC_PCLK4:
                        src = LL_RCC_I2C4_CLKSOURCE_PCLK4;
                        break;
                    case UNI_HAL_RCC_CLKSRC_PLL3R:
                        src = LL_RCC_I2C4_CLKSOURCE_PLL3R;
                        break;
                    case UNI_HAL_RCC_CLKSRC_HSI:
                        src = LL_RCC_I2C4_CLKSOURCE_HSI;
                        break;
                    case UNI_HAL_RCC_CLKSRC_CSI:
                        src = LL_RCC_I2C4_CLKSOURCE_CSI;
                        break;
                    default:
                        result = false;
                }
                if (result) {
                    LL_RCC_SetI2CClockSource(src);
                }
                break;
            }
            case UNI_HAL_CORE_PERIPH_RNG: {
                result = true;
                uint32_t src = 0;
                switch (source) {
                    case UNI_HAL_RCC_CLKSRC_HSI48:
                        src = LL_RCC_RNG_CLKSOURCE_HSI48;
                        break;
                    case UNI_HAL_RCC_CLKSRC_PLL1Q:
                        src = LL_RCC_RNG_CLKSOURCE_PLL1Q;
                        break;
                    case UNI_HAL_RCC_CLKSRC_LSE:
                        src = LL_RCC_RNG_CLKSOURCE_LSE;
                        break;
                    case UNI_HAL_RCC_CLKSRC_LSI:
                        src = LL_RCC_RNG_CLKSOURCE_LSI;
                        break;
                    default:
                        result = false;
                        break;
                }
                if (result) {
                    LL_RCC_SetRNGClockSource(src);
                }
                break;
            }
            case UNI_HAL_CORE_PERIPH_RTC: {
                uint32_t src = LL_RCC_RTC_CLKSOURCE_NONE;
                if (source == UNI_HAL_RCC_CLKSRC_LSE) {
                    src = LL_RCC_RTC_CLKSOURCE_LSE;
                } else if (source == UNI_HAL_RCC_CLKSRC_LSI) {
                    src = LL_RCC_RTC_CLKSOURCE_LSI;
                } else if (source == UNI_HAL_RCC_CLKSRC_HSE) {
                    src = LL_RCC_RTC_CLKSOURCE_HSE;
                } else {
                    src = LL_RCC_RTC_CLKSOURCE_NONE;
                }

                uni_hal_pwr_stm_set_backup_access(true);
                LL_RCC_SetRTCClockSource(src);
                uni_hal_pwr_stm_set_backup_access(false);
                result = true;
                break;
            }
            case UNI_HAL_CORE_PERIPH_SPI_1:
            case UNI_HAL_CORE_PERIPH_SPI_2:
            case UNI_HAL_CORE_PERIPH_SPI_3: {
                uint32_t src = UINT32_MAX;
                switch (source) {
                    case UNI_HAL_RCC_CLKSRC_PLL1Q:
                        src = LL_RCC_SPI123_CLKSOURCE_PLL1Q;
                        break;
                    case UNI_HAL_RCC_CLKSRC_PLL2P:
                        src = LL_RCC_SPI123_CLKSOURCE_PLL2P;
                        break;
                    case UNI_HAL_RCC_CLKSRC_PLL3P:
                        src = LL_RCC_SPI123_CLKSOURCE_PLL3P;
                        break;
                    case UNI_HAL_RCC_CLKSRC_I2S_CKIN:
                        src = LL_RCC_SPI123_CLKSOURCE_I2S_CKIN;
                        break;
                    case UNI_HAL_RCC_CLKSRC_CLKP:
                        src = LL_RCC_SPI123_CLKSOURCE_CLKP;
                        break;
                    default:
                        // unknown clock source
                        break;
                }
                if (src != UINT32_MAX) {
                    LL_RCC_SetSPIClockSource(src);
                    result = true;
                }
                break;
            }
            case UNI_HAL_CORE_PERIPH_SPI_4:
            case UNI_HAL_CORE_PERIPH_SPI_5:{
                uint32_t src = UINT32_MAX;
                switch (source) {
                    case UNI_HAL_RCC_CLKSRC_PCLK2:
                        src = LL_RCC_SPI45_CLKSOURCE_PCLK2;
                        break;
                    case UNI_HAL_RCC_CLKSRC_PLL2Q:
                        src = LL_RCC_SPI45_CLKSOURCE_PLL2Q;
                        break;
                    case UNI_HAL_RCC_CLKSRC_PLL3Q:
                        src = LL_RCC_SPI45_CLKSOURCE_PLL3Q;
                        break;
                    case UNI_HAL_RCC_CLKSRC_HSI:
                        src = LL_RCC_SPI45_CLKSOURCE_HSI;
                        break;
                    case UNI_HAL_RCC_CLKSRC_CSI:
                        src = LL_RCC_SPI45_CLKSOURCE_CSI;
                        break;
                    case UNI_HAL_RCC_CLKSRC_HSE:
                        src = LL_RCC_SPI45_CLKSOURCE_HSE;
                        break;
                    default:
                        // unknown clock source
                        break;
                }
                if (src != UINT32_MAX) {
                    LL_RCC_SetSPIClockSource(src);
                    result = true;
                }
                break;
            }
            case UNI_HAL_CORE_PERIPH_SPI_6:{
                uint32_t src = UINT32_MAX;
                switch (source) {
                    case UNI_HAL_RCC_CLKSRC_PCLK4:
                        src = LL_RCC_SPI6_CLKSOURCE_PCLK4;
                        break;
                    case UNI_HAL_RCC_CLKSRC_PLL2Q:
                        src = LL_RCC_SPI6_CLKSOURCE_PLL2Q;
                        break;
                    case UNI_HAL_RCC_CLKSRC_PLL3Q:
                        src = LL_RCC_SPI6_CLKSOURCE_PLL3Q;
                        break;
                    case UNI_HAL_RCC_CLKSRC_HSI:
                        src = LL_RCC_SPI6_CLKSOURCE_HSI;
                        break;
                    case UNI_HAL_RCC_CLKSRC_CSI:
                        src = LL_RCC_SPI6_CLKSOURCE_CSI;
                        break;
                    case UNI_HAL_RCC_CLKSRC_HSE:
                        src = LL_RCC_SPI6_CLKSOURCE_HSE;
                        break;
                    default:
                        // unknown clock source
                        break;
                }
                if (src != UINT32_MAX) {
                    LL_RCC_SetSPIClockSource(src);
                    result = true;
                }
                break;
            }
            case UNI_HAL_CORE_PERIPH_UART_2:
            case UNI_HAL_CORE_PERIPH_UART_3:
            case UNI_HAL_CORE_PERIPH_UART_4:
            case UNI_HAL_CORE_PERIPH_UART_5:
            case UNI_HAL_CORE_PERIPH_UART_7:
            case UNI_HAL_CORE_PERIPH_UART_8: {
                uint32_t src = UINT32_MAX;
                switch (source) {
                    case UNI_HAL_RCC_CLKSRC_CSI:
                        src = LL_RCC_USART234578_CLKSOURCE_CSI;
                        break;
                    case UNI_HAL_RCC_CLKSRC_LSE:
                        src = LL_RCC_USART234578_CLKSOURCE_LSE;
                        break;
                    case UNI_HAL_RCC_CLKSRC_HSI:
                        src = LL_RCC_USART234578_CLKSOURCE_HSI;
                        break;
                    case UNI_HAL_RCC_CLKSRC_PCLK1:
                        src = LL_RCC_USART234578_CLKSOURCE_PCLK1;
                        break;
                    case UNI_HAL_RCC_CLKSRC_PLL2Q:
                        src = LL_RCC_USART234578_CLKSOURCE_PLL2Q;
                        break;
                    case UNI_HAL_RCC_CLKSRC_PLL3Q:
                        src = LL_RCC_USART234578_CLKSOURCE_PLL3Q;
                        break;
                    default:
                        // unknown clock source
                        break;
                }
                if (src != UINT32_MAX) {
                    LL_RCC_SetUSARTClockSource(src);
                    result = true;
                }
                break;
            }
            default:
                // unknown periph
                break;
        }
    }

    return result;
}


//
// STM32H7 - specific
//

