Uni-Libraries/Uni.HAL/src/rcc/uni_hal_rcc_stm32h7.c
bool uni_hal_rcc_stm32h7_config_set(uni_hal_rcc_stm32h7_config_t *config) {
    bool result = false;
    if (config != nullptr) {
        g_uni_hal_rcc_config = config;
        result = true;
    }
    return result;
}

uni_hal_rcc_stm32h7_status_t uni_hal_rcc_stm32h7_status_get() {
    return g_uni_hal_rcc_status;
}


uint32_t uni_hal_rcc_stm32_mco_enable(uint32_t mco_index, uni_hal_rcc_clksrc_e clock_source, uint32_t clock_divider) {
    uint32_t result = 0U;
    if (mco_index < 2 && clock_divider >= 1 && clock_divider <= 15) {
        // configure pin
        uni_hal_gpio_pin_context_t pin = {
                .gpio_bank = mco_index == 0 ? UNI_HAL_CORE_PERIPH_GPIO_A : UNI_HAL_CORE_PERIPH_GPIO_C,
                .gpio_pin = mco_index == 0 ? UNI_HAL_GPIO_PIN_8 : UNI_HAL_GPIO_PIN_9,
                .gpio_speed = UNI_HAL_GPIO_SPEED_3,
                .gpio_type = UNI_HAL_GPIO_TYPE_ALTERNATE_PP,
                .alternate = UNI_HAL_GPIO_ALTERNATE_0,
        };
        if (!uni_hal_gpio_pin_init(&pin)) {
            return 0U;
        }

        uint32_t source = UINT32_MAX;
        uint32_t prescaler = UINT32_MAX;
        switch (clock_source) {
            case UNI_HAL_RCC_CLKSRC_HSI:
                source = mco_index == 0 ? LL_RCC_MCO1SOURCE_HSI : UINT32_MAX;
                break;
            case UNI_HAL_RCC_CLKSRC_LSE:
                source = mco_index == 0 ? LL_RCC_MCO1SOURCE_LSE : UINT32_MAX;
                break;
            case UNI_HAL_RCC_CLKSRC_HSE:
                source = mco_index == 0 ? LL_RCC_MCO1SOURCE_HSE : LL_RCC_MCO2SOURCE_HSE;
                break;
            case UNI_HAL_RCC_CLKSRC_PLL1Q:
                source = mco_index == 0 ? LL_RCC_MCO1SOURCE_PLL1QCLK : UINT32_MAX;
                break;
            case UNI_HAL_RCC_CLKSRC_HSI48:
                source = mco_index == 0 ? LL_RCC_MCO1SOURCE_HSI48 : UINT32_MAX;
                break;
            case UNI_HAL_RCC_CLKSRC_SYSCLK:
                source = mco_index == 0 ? UINT32_MAX : LL_RCC_MCO2SOURCE_SYSCLK;
                break;
            case UNI_HAL_RCC_CLKSRC_PLL1P:
                source = mco_index == 0 ? UINT32_MAX : LL_RCC_MCO2SOURCE_PLL1PCLK;
                break;
            case UNI_HAL_RCC_CLKSRC_PLL2P:
                source = mco_index == 0 ? UINT32_MAX : LL_RCC_MCO2SOURCE_PLL2PCLK;
                break;
            case UNI_HAL_RCC_CLKSRC_CSI:
                source = mco_index == 0 ? UINT32_MAX : LL_RCC_MCO2SOURCE_CSI;
                break;
            case UNI_HAL_RCC_CLKSRC_LSI:
                source = mco_index == 0 ? UINT32_MAX : LL_RCC_MCO2SOURCE_LSI;
                break;
            default:
                break;
        }

        switch (clock_divider) {
            case 1:
                prescaler = mco_index == 0 ? LL_RCC_MCO1_DIV_1 : LL_RCC_MCO2_DIV_1;
                break;
            case 2:
                prescaler = mco_index == 0 ? LL_RCC_MCO1_DIV_2 : LL_RCC_MCO2_DIV_2;
                break;
            case 3:
                prescaler = mco_index == 0 ? LL_RCC_MCO1_DIV_3 : LL_RCC_MCO2_DIV_3;
                break;
            case 4:
                prescaler = mco_index == 0 ? LL_RCC_MCO1_DIV_4 : LL_RCC_MCO2_DIV_4;
                break;
            case 5:
                prescaler = mco_index == 0 ? LL_RCC_MCO1_DIV_5 : LL_RCC_MCO2_DIV_5;
                break;
            case 6:
                prescaler = mco_index == 0 ? LL_RCC_MCO1_DIV_6 : LL_RCC_MCO2_DIV_6;
                break;
            case 7:
                prescaler = mco_index == 0 ? LL_RCC_MCO1_DIV_7 : LL_RCC_MCO2_DIV_7;
                break;
            case 8:
                prescaler = mco_index == 0 ? LL_RCC_MCO1_DIV_8 : LL_RCC_MCO2_DIV_8;
                break;
            case 9:
                prescaler = mco_index == 0 ? LL_RCC_MCO1_DIV_9 : LL_RCC_MCO2_DIV_9;
                break;
            case 10:
                prescaler = mco_index == 0 ? LL_RCC_MCO1_DIV_10 : LL_RCC_MCO2_DIV_10;
                break;
            case 11:
                prescaler = mco_index == 0 ? LL_RCC_MCO1_DIV_11 : LL_RCC_MCO2_DIV_11;
                break;
            case 12:
                prescaler = mco_index == 0 ? LL_RCC_MCO1_DIV_12 : LL_RCC_MCO2_DIV_12;
                break;
            case 13:
                prescaler = mco_index == 0 ? LL_RCC_MCO1_DIV_13 : LL_RCC_MCO2_DIV_13;
                break;
            case 14:
                prescaler = mco_index == 0 ? LL_RCC_MCO1_DIV_14 : LL_RCC_MCO2_DIV_14;
                break;
            case 15:
                prescaler = mco_index == 0 ? LL_RCC_MCO1_DIV_15 : LL_RCC_MCO2_DIV_15;
                break;
            default:
                break;
        }

        if (source != UINT32_MAX && prescaler != UINT32_MAX) {
            LL_RCC_ConfigMCO(source, prescaler);
            result = 1U;
        }
    }
    return result;
}



//
// STM32H7 - Interrupts
//


void NMI_Handler(void) {
    if (LL_RCC_IsActiveFlag_HSECSS()) {
        LL_RCC_ClearFlag_HSECSS();

        if (g_uni_hal_rcc_css_nmi_processing) {
            g_uni_hal_rcc_css_event_latched = true;
            LL_RCC_ClearFlag_HSECSS();
            return;
        }

        g_uni_hal_rcc_css_nmi_processing = true;

        LL_RCC_ClearFlag_HSECSS();
        if (g_uni_hal_rcc_config != nullptr) {
            g_uni_hal_rcc_config->hse_enable = false;
        }

        _uni_hal_stm_rcc_css_request_recovery();

        LL_RCC_HSE_Disable();
        (void)_uni_hal_stm_rcc_wait_ready_nmi(LL_RCC_HSE_IsReady, false);

        bool recovered = _uni_hal_stm_rcc_nmi_fallback_to_safe_clk();
        if (recovered) {
            g_uni_hal_rcc_status.css_recovery_pending = false;
        }

        LL_RCC_ClearFlag_HSECSS();
        g_uni_hal_rcc_css_nmi_processing = false;
    }
}
